Revit 2024 API
Wall.CrossSection Property
 Obtain the Wall Cross-section for this wall.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public WallCrossSection CrossSection { get; set; }
Visual Basic
Public Property CrossSection As WallCrossSection
	Get
	Set
Visual C++
public:
property WallCrossSection CrossSection {
	WallCrossSection get ();
	void set (WallCrossSection value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: The current wall does not support the cross section wallCrossSection.
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Wall Class
Autodesk.Revit.DB Namespace